In [5]:
"""importing libraries"""
import pandas as pd
import numpy as np
#loading of data
sal = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [6]:
# checking if object has the right data in it by checking 1st 5 record
sal.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [7]:
"""checking if the data is in the right data type"""
sal.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [10]:
#check the name of colums
sal.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [11]:
#check number of rows and colums (dimensionality)
sal.shape

(78, 6)

In [13]:
#number of elements in the data set
sal.size

468

In [17]:
 #General descriptive statistics for the numeric columns only 
sal.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

From this, the highest salary collected is 186960

In [20]:
#standard deviation for all numeric columns
sal.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [22]:
#mean of first 50 numeric records
sal.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [23]:
sal['service']

0     49
1      6
2     20
3     31
4     18
      ..
73    10
74     6
75    17
76    14
77    15
Name: service, Length: 78, dtype: int64

In [24]:
#basic statistics for salary column
sal['salary'].describe()

count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

In [25]:
#values in the salary column
sal['salary'].count()

78

In [26]:
#average salary in the data set
sal['salary'].mean()

108023.78205128205

In [41]:
#grouping using rank (categoratical columns)
grpRank=sal.groupby(['rank'])

In [42]:
grpRank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

From the mean data gotten it can be seen that on average, professors earn more than associate professors and asst professors earn less than associates also.

In [51]:
#grouping based on sex
grpSex = sal.groupby(['sex'])

In [64]:
grpSex.describe()

         phd                                                    service  \
       count       mean        std  min   25%   50%   75%   max   count
sex
Female  39.0  16.512821   9.784176  2.0  10.0  17.0  23.5  39.0    39.0
Male    39.0  22.897436  14.138032  1.0  12.0  21.0  31.5  56.0    39.0

                   ...             salary                               \
             mean  ...   75%   max  count           mean           std
sex                ...
Female  11.564103  ...  17.5  36.0   39.0  101002.410256  25952.127317
Male    18.538462  ...  25.0  51.0   39.0  115045.153846  29110.516397


            min      25%       50%       75%       max
sex
Female  62884.0  77250.0  103750.0  117002.5  161101.0
Male    57800.0  92000.0  107300.0  132991.5  186960.0

[2 rows x 24 columns]

from the data gotten, it can be seen that males were given greater opportunity than women. As males have higher phd, higher salary etc.

In [96]:
%time
#being more specific and grouping based on rank and salary
sal.groupby(['rank'])[['salary']].describe()

Wall time: 0 ns

          salary                                                            \
           count           mean           std      min       25%       50%
rank
AssocProf   13.0   91786.230769  18571.183714  62884.0   74830.0  103613.0
AsstProf    19.0   81362.789474   9381.245301  63100.0   74096.0   78500.0
Prof        46.0  123624.804348  24850.287853  57800.0  105112.5  123321.5


                 75%       max
rank
AssocProf  104542.00  119800.0
AsstProf    91150.00   97032.0
Prof       143512.25  186960.0